<!DOCTYPE html>
<html lang="pt-BR">
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Dota Dragon's Blood</title>
        <!-- Icone personalizado -->
        <link rel="icon" href="./image/icon/favicon.ico" type="image/x-icon"/>
        <!-- Estilização do Site -->
        <link rel="stylesheet" type="text/css" href="../css/style.css">
        <!-- Link do Box Icons -->
        <link href='https://unpkg.com/boxicons@2.0.9/css/boxicons.min.css' rel='stylesheet'>
    </head>
    <body>
        <!-- Barra Lateral -->
        <nav class="sidebar">
            <div class="logo_details">
                <i class='bx bxl-steam'></i>
                <div class="logo_name">Dragon's Blood</div>
            </div>
            <ul class="nav_links">
                <li>
                    <a href="../index.html">
                        <i class='bx bx-home' ></i>
                        <span class="link_name">In&iacute;cio</span>
                    </a>
                    <ul class="sub_menu blank">
                        <li><a class="link_name" href="../index.html">Início</a></li>
                    </ul>
                </li>
                <li>
                    <div class="icon_link">
                        <a href="./heroes.html">
                            <i class='bx bx-trophy' ></i>
                            <span class="link_name">Her&oacute;is</span>
                        </a>
                        <i class='bx bxs-chevron-down arrow'></i>
                    </div>
                    <ul class="sub_menu">
                        <li><a class="link_name" href="./heroes.html">Her&oacute;is</a></li>
                        <li><a href="#dragon_knight">Dragon Knight</a></li>
                        <li><a href="#mirana">Mirana</a></li>
                        <li><a href="#luna">Luna</a></li>
                        <li><a href="#invoker">Invoker</a></li>
                        <li><a href="#terrorblade">Terrorblade</a></li>
                    </ul>
                </li>
                <li>
                    <a href="./episodes.html">
                        <i class='bx bx-film' ></i>
                        <span class="link_name">Epis&oacute;dios</span>
                    </a>
                    <ul class="sub_menu blank">
                        <li><a class="link_name" href="./episodes.html">Epis&oacute;dios</a></li>
                    </ul>
                </li>
                <li>
                    <a href="./about.html">
                        <i class='bx bx-info-circle' ></i>
                        <span class="link_name">Sobre</span>
                    </a>
                    <ul class="sub_menu blank">
                        <li><a class="link_name" href="./about.html">Sobre</a></li>
                    </ul>
                </li>
                <li>
                    <a href="./contact.html">
                        <i class='bx bxs-contact' ></i>
                        <span class="link_name">Contato</span>
                    </a>
                    <ul class="sub_menu blank">
                        <li><a class="link_name" href="./contact.html">Contato</a></li>
                    </ul>
                </li>
            </ul>
        </nav>

        <section class="home_section" id="heroes">

            <header class="mainTitle">
                <div class="sidebar_btn">
                    <i class='bx bx-menu' id="btn"></i>
                </div>
                <h2>Her&oacute;is de Dota</h2>
            </header>

            <div class="mainContent">

                <article>
                    <section class="heroBiography" id="dragon_knight">
                        <div class="charName">
                            <h2>Dragon Knight</h2>
                        </div>
                        <div class="charBio">
                            <img class="img1" src="../image/heroes/Davion_DK.jpg">
                            <p>
                                Depois de anos e anos atr&aacute;s de um lend&aacute;rio eldwurm, Sir Davion encontrou-se a enfrentar um advers&aacute;rio decepcionante: o tem&iacute;vel Slyrak, que se tornara velho e fr&aacute;gil, de asas esfarrapadas, com as pouscas e restantes escamas a apodrecer, os seus dentes mais que gastos e o seu sopro de fogo não mais amea&ccedil;ador do que meia d&uacute;zia de f&oacute;sforos molhados.<br /><br />
                                Vendo nenhuma honra em assassinar tal criatura, Davion preparou-se para virar as costas e deixar o seu velho advers&aacute;rio a morrer em paz. Mas uma voz surgiu nos seus pensamentos: Slyrak fez um apelo sussurrante para que Davion o honrasse com uma morte em combate. Davion concordou, e viu-se a ser recompensado para al&eacute;m do que esperava pelo seu ato de miseric&oacute;rdia: no momento em que cravou a sua espada no peito de Slyrak, o drag&atilde;o perfurou a garganta de Davion com uma das garras. Enquanto o sangue dos dois se misturava, Slyrak enviou o seu poder atrav&eacute;s do fluxo sangu&iacute;neo, enviando toda a sua for&ccedil;a e s&eacute;culos de sabedoria para o cavaleiro. A morte do drag&atilde;o selou o elo entre os dois, e assim nascera Dragon Knight, o Cavaleiro Drag&atilde;o. O poder ancestral dorme dentro do Cavaleiro Drag&atilde;o Davion, acordando quando este o chama. Ou talvez seja o Drag&atilde;o que chama o Cavaleiro...
                            </p>
                        </div>
                    </section>
                    <section class="heroBiography" id="mirana">
                        <div class="charName">
                            <h2>Mirana</h2>
                        </div>
                        <div class="charBio">
                            <img class="img2" src="../image/heroes/MIRANA.jpg">
                            <p>
                                Mirana, nascida numa fam&iacute;lia real e sendo a pr&oacute;xima herdeira na sucess&atilde;o do Trono Solar, desistiu de bom grado de qualquer reivindica&ccedil;&atilde;o de terrenos ou t&iacute;tulos mundanos para se dedicar completamente ao servi&ccedil;o de Selemene, a Deusa da Lua. Conhecida desde ent&atilde;o como Princesa da Lua, Mirana patrulha o sagrado Bosque de Nightsilver, procurando por qualquer um que ousasse roubar as sagradas flores de l&oacute;tus luminosas dos charcos prateados da reserva da Deusa. Montada no seu enorme familiar felino, ela &eacute; orgulhosa, destemida e est&aacute; sempre alerta, em sintonia com as fases da lua e os ciclos das grandes constela&ccedil;&otilde;es. O seu arco, adornado com peda&ccedil;os afiados de min&eacute;rio lunar, drena da lua a for&ccedil;a para carregar as suas flechas de luz.
                            </p>
                        </div>
                    </section>
                    <section class="heroBiography" id="luna">
                        <div class="charName">
                            <h2>Luna</h2>
                        </div>
                        <div class="charBio">
                            <img class="img1" src="../image/heroes/LUNA.jpg">
                            <p>
                                Como &eacute; que ela chegou a este ponto? Ela foi outrora o Flagelo das Plan&iacute;cies, uma l&iacute;der impiedosa de homens e monstros, capaz de espalhar o terror por onde passasse. Agora estava longe da sua terra natal, levada quase &agrave; loucura devido &agrave; fome e aos meses de perambula&ccedil;&atilde;o, o seu ex&eacute;rcito h&aacute; muito tempo morto, ou pior. &Agrave; medida que ela se aproximava de uma antiga floresta, um par de olhos brilhantes observava-a a partir de um ramo velho. Algo lind&iacute;ssimo e mort&iacute;fero procurava uma refei&ccedil;&atilde;o na escurid&atilde;o que se aproximava. Sem fazer um som, virou-se e foi-se embora. A f&uacute;ria apoderou-se dela. Com uma adaga ferrugenta na m&atilde;o, correu atr&aacute;s da fera, determinada em reclamar pelo menos um pouco de sua antiga gl&oacute;ria, mas a sua presa n&atilde;o se deixava apanhar. Tr&ecirc;s vezes ela encurralou a criatura entre pedras e &aacute;rvores, e tr&ecirc;s vezes a atacou, apenas para ver a sua sombra a desaparecer no meio do bosque. Por&eacute;m, a lua cheia brilhava com for&ccedil;a, o que tornava f&aacute;cil encontrar o rastro da criatura.<br /><br />
                                Chegando a uma clareirano topo de uma colina, a massiva forma felina da fera sentou-se no meio do local, atenta e &agrave; espera. Quando a mulher brandiu a sua adaga, a criatura recuou, rugiu e atacou. Pareceu que a morte decidiu finalmente vir ter com ela neste estranho local. Ela n&atilde;o se mexeu, estava calma e pronta. Num instante, a criatura arrebatou a adaga das suas m&atilde;os antes de desaparecer no meio da floresta. Quietude. Figuras encapuzadas aproximaram-se. Com um tom reverente, revelaram que Selemene, Deusa da Lua, a tinha escolhido, guiado e testado. Sem saber, ela tinha passado os rituais sagrados da Lua Negra, os guerreiros do Bosque de Nightsilver.<br /><br />
                                Ofereceram-lhe uma escolha: juntar-se &agrave; Lua Negra e entregar-se ao servi&ccedil;o de Selemene ou partir e nunca mais voltar. Ela n&atilde;o hesitou. Aceitando a sua absolvi&ccedil;&atilde;o, renunciou ao seu passado sangrento e adotou uma nova identidade como Luna da Lua Negra, a temida Cavaleira da Lua, a implac&aacute;vel e sempre leal guardi&atilde; do Bosque de Nightsilver.
                            </p>
                        </div>
                    </section>
                    <section class="heroBiography" id="invoker">
                        <div class="charName">
                            <h2>Invoker</h2>
                        </div>
                        <div class="charBio">
                            <img class="img2" src="../image/heroes/INVOKER.jpg">
                            <p>
                                Na sua mais antiga, e segundo alguns, mais potente forma, a magia era principalmente conhecida como a arte da mem&oacute;ria. N&atilde;o requeria tecnologia, nem varinhas ou qualquer outro instrumento sem ser a pr&oacute;pria mente do mago. Toda a simbologia dos rituais baseava-se apenas em recursos mnem&oacute;nicos, pensados para ajudar o praticante a lembrar-se da exata f&oacute;rmula mental de um feiti&ccedil;o.<br /><br />
                                Os maiores magos desses tempos eram os que tinham sido aben&ccedil;oados com boa mem&oacute;ria, e t&atilde;o complexas eram as invoca&ccedil;&otilde;es que todos os feiticeiros eram for&ccedil;ados a especializar-se. O mais devoto tinha a esperan&ccedil;a de, durante a sua vida, poder lembrar-se adequadamente de tr&ecirc;s feiti&ccedil;os - no m&aacute;ximo quatro. Feiticeiros normais contentavam-se em saber dois, e n&atilde;o era invulgar para um mago de aldeia saber apenas um - mesmo com a necessidade de consultar grim&oacute;rios como auxiliar de mem&oacute;ria nas raras ocasi&otilde;es em que ele tivesse sido chamado para o usar.<br /><br />
                                Mas entre estes antigos praticantes havia uma exce&ccedil;&atilde;o, um g&ecirc;nio de vasto intelecto e de mem&oacute;ria prodigiosa, que ficou conhecido como Invoker. Na sua juventude, o precoce feiticeiro dominou n&atilde;o quatro, n&atilde;o cinco, nem sequer sete encantamentos: ele dominava n&atilde;o menos de dez feiti&ccedil;os, e podia lan&ccedil;a-los instantaneamente. Muitos mais feiti&ccedil;os ele aprendeu, mas achava-os in&uacute;teis, e praticou os tais uma vez para depois apag&aacute;-los da sua mente para sempre, de modo a ter espaço para invoca&ccedil;&otilde;es mais &uacute;teis. Uma dessas era o Encantamento Sempiterno - um feiti&ccedil;o de lengevidade de poder tal, que aqueles que o invocaram nos primeiros dias do mundo ainda est&atilde;o entre n&oacute;s (a n&atilde;o ser que tenham sido esmagados at&eacute; ao &aacute;tomo).<br /><br />
                                A maioria destes quase-imortais vive discretamente, com medo de admitir o seu segredo. Mas o Invoker n&atilde;o &eacute; de manter os seus dons escondidos. Ele &eacute; ancestral, aprendeu mais do que todos os outros, e a sua mente ainda tem espa&ccedil;o para conter mais um grande senso do seu pr&oacute;prio valor... assim como as invoca&ccedil;&otilde;es com que ele se tem entretido durante o longo e lento crep&uacute;sculo dos &uacute;ltimos dias do mundo.
                            </p>
                        </div>
                    </section>
                    <section class="heroBiography" id="terrorblade">
                        <div class="charName">
                            <h2>Terrorblade</h2>
                        </div>
                        <div class="charBio">
                            <img class="img1" src="../image/heroes/TERRORBLADE.jpg">
                            <p>
                                Terrorblade &eacute; um saqueador demon&iacute;aco, um fora da lei infernal, temido at&eacute; por outros dem&ocirc;nios. Um iconoclasta c&oacute;smico, ele roubou dos Senhores Demon&iacute;acos, ignorou os rituais codificados que deveriam controlar o seu comportamento e violou todas as leis das sete Regi&otilde;es Infernais. Gra&ccedil;as aos seus crimes, ele aprendeu uma li&ccedil;&atilde;o: at&eacute; o Inferno tem um Inferno. Deu-se um julgamento breve e violento, com muitos mortos por todo o lado e, ap&oacute;s isso, Terrorblade foi finalmente encarcerado em Foulfell, uma dimens&atilde;o escondida onde os dem&ocirc;nios prendem os seus semelhantes.<br /><br />
                                Mas Foulfell n&atilde;o &eacute; uma pris&atilde;o normal. Neste espelho negro da realidade, a senten&ccedil;a de todos os dem&ocirc;nios aqui presos &eacute; olhar eternamente para o reflexo deformado das suas pr&oacute;prias almas. Mas em vez de sofrer, Terrorblade aprendeu a dominar o seu reflexo, o seu pior lado; uma criatura furiosa e furtiva, de poderes inimagin&aacute;veis. Com o seu dem&ocirc;nio interior sob controle, ele destruiu as paredes da pris&atilde;o fractal e escapou, ficando livre para espalhar o terror por todos os planos da exist&ecirc;ncia.
                            </p>
                        </div>
                    </section>
                </article>

            </div>

            <footer class="copy">
                <p>Copyright &copy; 2022. Todos os direitos reservados.</p>
            </footer>

        </section>

        <!-- Script da barra lateral -->
        <script src="../javascript/sidbar-menu.js"></script>
    </body>
</html>